jayis1/daily-ideas/systems/soc-devices/cor-sono/firmware/sdkconfig.defaults
# Cor Sono — ESP32-S3 sdkconfig defaults

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Flash / PSRAM
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MODE_OCTAL=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Partition table (custom: model + audio + nvs)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_SMP=y

# BLE
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=4

# Wi-Fi
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n

# PSRAM-aware malloc (for CNN weights + audio buffers)
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y